openFoamRepoDev/etc/templates/axisymmetricJet/system/extrudeMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      extrudeProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

constructFrom   patch;
sourceCase      "<case>";

sourcePatches   (front);
exposedPatchName back;

extrudeModel    wedge;

sectorCoeffs
{
    point       (0 0 0);
    axis        (1 0 0);
    angle       1;
}

flipNormals     false;

mergeFaces      false;

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
